import org.testng.annotations.Test;
import pageObjects.*;
import ru.yandex.qatools.allure.annotations.Features;
import ru.yandex.qatools.allure.annotations.Stories;
import ru.yandex.qatools.allure.annotations.Title;
import utils.Properties;
import utils.Utils;

import java.util.ArrayList;

import static utils.Utils.sleep;

/**
 * Created by Michael Strizhov on 21.03.2017.
 */
@Features("Тестирование МПГУ услуга 'Запись в детский сад'")
public class MpguTestFailed extends TestInit{
    Utils util;
    Properties properties = new Properties();

    String windowHandle;

    @Stories("Демонстрационные тесты")
    @Title("ДемоТест1")
    @Test
    void testBody() {

        /*===================================================
        Шаг 1
        Вызов <Вход в личный кабинет (ФЛ)
        =====================================================*/
        MpguMainPage mpguMainPage = new MpguMainPage(driver);
        mpguMainPage.pressLogin();

        LoginPage loginPage = new LoginPage(driver);
        loginPage.enterLoginPassword();
        loginPage.pressEnter();

       /*===================================================
        Шаг 2
        В списке "Категории услуг" выбрать "Образование, учеба"
        ----------------------------------------------------
        Проверить:
        Отобразился список услуг принадлежащих к данной категории
        =====================================================*/
        mpguMainPage.pressEducatiom();
       /*===================================================
        Шаг 3
        Нажать на иконку услуги "Детские сады", выбрать услугу "Запись в детский сад".
        https://pgu.mos.ru/ru/services/link/1742
        ----------------------------------------------------
        Проверить:
        Услуга выбрана, открылась посадочная страница.
        =====================================================*/
        ServicesPage servicesPage = new ServicesPage(driver);
        servicesPage.pressEntryToKindergarten();
        //Проверка 'Услуга выбрана, открылась посадочная страница.
        EntryToKindergartenMainPage entryToKindergartenMainPage = new EntryToKindergartenMainPage(driver);
        entryToKindergartenMainPage.switchTabs("Получение информации о выбранных дошкольных образовательных учреждениях");
        entryToKindergartenMainPage.checkPageOpened();
       /*===================================================
        Шаг 5
        Нажать на кнопку "Получить услугу". https://pgu.mos.ru/ru/application/dogm/77060101/
        ----------------------------------------------------
        Проверить:
        Отобразилась страница услуги "Запись в детский сад", активен шаг 1 "Выбор образовательной организации".
        =====================================================*/
        entryToKindergartenMainPage.pressGetService();
        KindergartenServiceStep1Page step1Page = new KindergartenServiceStep1Page(driver);
        windowHandle = driver.getWindowHandle();
        step1Page.checkPageOpened();
       /*===================================================
        Шаг 6
        'Нажать ссылку "Информация по оформлению заявления"
        ----------------------------------------------------
        Проверить:
        'Открылось окно "Инструкция по оформлению услуги"
        =====================================================*/
//        step1Page.pressApplicationInfo2();
        step1Page.pressApplicationInfo();
       /*===================================================
        Шаг 7
        Нажать на символ "Х" или на кнопку "Закрыть"
        ----------------------------------------------------
        Проверить:
        Окно с "Инструкция по оформлению услуги" закрылось, отобразился первый шаг услуги
        =====================================================*/
//        log.info("Step 7");
        step1Page.pressCloseApplicationInfo();
        /*===================================================
        Шаг 8
        'Нажать на ссылку "Информация по оформлению заявления" и нажать на ссылку "Скачать инструкцию"
        ----------------------------------------------------
        Проверить:
        'Успешное скачивание инструкции
        =====================================================*/
        step1Page.pressApplicationInfo();
        //step1Page.pressPrintApplicationInfo();
       /*===================================================
        Шаг 9
        Нажать на символ "Х" или на кнопку "Закрыть"
        ----------------------------------------------------
        Проверить:
        Окно с "Инструкция по оформлению услуги" закрылось, отобразился первый шаг услуги
        =====================================================*/
       //переключаемся с вкладки печать
        //sleep(3000);
        //driver.switchTo().window(windowHandle);

        //switchTabs("Получение информации о выбранных дошкольных образовательных учреждениях");
        step1Page.pressCloseApplicationInfo();

       /*===================================================
        Шаг 10
        'Нажать на ссылку "часто задаваемые вопросы".
        ----------------------------------------------------
        Проверить:
        'Отобразилась страница "Вопросы и ответы", задан фильтр по данной услуге.
        =====================================================*/
        MpguFaqPage mpguFaqPage = new MpguFaqPage(driver);
        step1Page.pressFAQLink();
        mpguFaqPage.checkFAQLinkForStep10();
        //возвращаемя на страницу услуги
        step1Page.openPage();

       /*===================================================
        Шаг 11
        В поле "Дата рождения ребенка" ввести корректную дату (возраст ребенка должен быть менее 7 лет)
        ----------------------------------------------------
        Проверить:
        В поле отобразилась введенная дата.
        =====================================================*/
        step1Page.enterChildBirthDate();
       /*===================================================
        Шаг 12
        'Проверить наличие инфоблока "На 1 сентября желаемого года поступления ребенку должно быть менее 7 лет".
        ----------------------------------------------------
        Проверить:
        'Инфоблок присуствует на форме.
        =====================================================*/
        step1Page.checkTextChildBirthDateRestriction();
       /*===================================================
        Шаг 13
        Из выпадающего списка "Желаемый год поступления на 1 сентября" выбрать "1 сентября 201X года", где Х - цифра
        ----------------------------------------------------
        Проверить:
        В поле отобразился выбранный вариант. Подсказка, отображавшаяся справа, исчезла. Под полем отобразилась информация "На указанную Вами дату 1 сентября 201X года вашему ребенку будет Х лет Y месяцев" , где X и Y - цифры.
        =====================================================*/
        step1Page.enterSelectWishingEnterDate(Properties.getProperty("Step13_WishingEnterDate"));
       /*===================================================
        Шаг 14
        'Из выпадающего списка "  Желаемый год поступления на 1 сентября" выбрать значение из списка.
        ----------------------------------------------------
        Проверить:
        'В поле отобразился выбранный вариант. Под полем отобразилась информация "На указанную Вами дату вашему ребенку будет Х (года) лет Y месяцев" , где X и Y - цифры.
        =====================================================*/
        step1Page.enterSelectWishingEnterDate(Properties.getProperty("Step14_WishingEnterDate"));
       /*===================================================
        Шаг 15
        Включить чекбокс "Направить ребенка для зачисления в группу кратковременного пребывания".
        ----------------------------------------------------
        Проверить:
        Чекбокс включен.
        Отобразилось поле "С 1 сентября" с выпадающим списком.
        =====================================================*/
        step1Page.turnCheckboxShortTermGroup();
       /*===================================================
        Шаг 16
        'В поле "С 1 сентября" выбрать одно из значений.
        ----------------------------------------------------
        Проверить:
        'В поле отобразилось выбранное значение.
        =====================================================*/
        step1Page.choiceShortTermGroupStartTime();
       /*===================================================
        Шаг 17
        Кликнуть на значок "?" справа от чекбокса "Направить ребенка для зачисления в группу кратковременного пребывания"
        ----------------------------------------------------
        Проверить:
        Отобразилась подсказка с текстом
        "На 1 сентября желаемого года поступления ребенку должно быть больше 2 месяцев и меньше 7 лет "
        =====================================================*/
        step1Page.clickShortTermGroupStartTimeInfo();
       /*===================================================
        Шаг 18
        Закрыть подсказку, нажав на "х" или нажав на любую область страницы
        ----------------------------------------------------
        Проверить:
        Подсказка закрылась
        =====================================================*/
        step1Page.clickStep18AnyplaceOnPage();
       /*===================================================
        Шаг 19
        В поле "Тип регистрации ребенка" радиокнопку "По месту пребывания на территории города Москвы".
        ----------------------------------------------------
        Проверить:
        Выбранная радиокнопка включена.
        =====================================================*/
        step1Page.clickPlaceRegistrationOfChild();
       /*===================================================
        Шаг 20
        'Убедиться в наличии текстового блока:
        "Для адресов вида Зеленоград, корпус NNN, следует вводить улицу "Зеленоград".
        В случае отсутствия номера квартиры (для частных домов и др.) необходимо указать значение "1".
        ----------------------------------------------------
        Проверить:
        'Блок есть.
        =====================================================*/
        step1Page.checkTextZelenograd();
       /*===================================================
        Шаг 21
        Убедиться, что чекбокс "Улицы нет в спиcке" выключен.
        ----------------------------------------------------
        Проверить:
        Чекбокс выключен.
        =====================================================*/
        step1Page.checkIsCheckboxStreetNotInList();
       /*===================================================
        Шаг 22
        'Кликнуть на значек "?" справа от поля "Улица".
        ----------------------------------------------------
        Проверить:
        Отобразилась подсказка с текстом
        "Для адресов вида Зеленоград, корпус NNN, следует вводить улицу "Зеленоград""
        =====================================================*/
        step1Page.clickOnStreetInfoButton();
       /*===================================================
        Шаг 23
        В поле "Улица" ввести первые несколько букв названия необходимой улицы.
        ----------------------------------------------------
        Проверить:
        Отобразился список улиц, содержащих данные буквы.
        =====================================================*/
        step1Page.enterFirstLettersChildRegistrationStreet();
       /*===================================================
        Шаг 24
        'Из списка выбрать необходимый вариант.
        ----------------------------------------------------
        Проверить:
        'В поле "Улица" отобразился выбранный вариант.
        =====================================================*/
        step1Page.enterChildRegistrationStreet();
       /*===================================================
        Шаг 25
        В поле "Дом" выбрать из списка необходимый вариант.
        ----------------------------------------------------
        Проверить:
        В поле отобразился необходимый вариант.  Поля "Округ" и "Район" заполнились автоматически.
        =====================================================*/
        step1Page.enterChildRegistrationHouse();
       /*===================================================
        Шаг 26
        'В поле "Квартира" ввести корректные данные.
        ----------------------------------------------------
        Проверить:
        'В поле отобразились введенные данные.
        =====================================================*/
        step1Page.enterChildRegistrationFlat();
       /*===================================================
        Шаг 27
        Включить чекбокс "Улицы нет в списке".
        ----------------------------------------------------
        Проверить:
        Все поля очистились.
        Поля "Округ" и "Район" стали выпадающими списками.
        Появилось  поле "Дом* /корпус/строение"
        =====================================================*/
        step1Page.clickCheckboxStreetNotInList();
       /*===================================================
        Шаг 28
        Заполнить следующие поля корректными данными:
         - Округ (выбор из справочника)
         - Район (выбор из справочника)
         - Улица
         - Дом
         - Корпус
         - Строение
         - Квартира
        ----------------------------------------------------
        Проверить:
        'В полях отобразились ввденные значения.
        =====================================================*/
        step1Page.enterChildRegistration();
        /*===================================================
        Шаг 29
        В блоке "За данным адресом закреплены следующие образовательные организации:" включить радиокнопку "Поиск по названию"
        ----------------------------------------------------
        Проверить:
        Радиокнопка включена.
        Появилось поле "Поиск".
        =====================================================*/
        step1Page.pressButtonSearchSchoolByName();
        /*===================================================
        Шаг 32
        'В поле "Поиск" ввести название учебного заведения, например, "Детский сад №20".
        ----------------------------------------------------
        Проверить:
        'В поле отобразилось введенное значение.
        =====================================================*/
        step1Page.enterSchoolNameForSearch();
        /*===================================================
        Шаг 33
        Нажать на кнопку "Найти".
        ----------------------------------------------------
        Проверить:
        Отобразился блок "Результаты поиска организаций" со списком найденных организаций.
            Для каждой организации отображается:
            - Название ОУ
            - Директор
            - Адрес
            - Телефоны
            - Сайт
            - Здания
            - кнопки "Приоритетная", Дополнительная 1", "Дополнительная 2"
            - ссылка "Показать на карте".
        =====================================================*/
        step1Page.pressSearchBySchoolName();
        /*===================================================
        Шаг 34
        'Включить радиокнопку "Поиск по местоположению"
        ----------------------------------------------------
        Проверить:
        'Радиокнопка включена.
        Появились поля "Место нахождения", "Тип организации"
        =====================================================*/
        step1Page.pressButtonSearchSchoolByPlace();
        /*===================================================
        Шаг 35
        В поле "Место нахождения" включить "округ"
        ----------------------------------------------------
        Проверить:
        Появились поля "Округ" и "Район"
        =====================================================*/
        step1Page.clickRadiobuttonSearchSchoolByRayon();
        /*===================================================
        Шаг 36
        'В поле "Округ" выбрать из списка любое значение.
        ----------------------------------------------------
        Проверить:
        'В поле отобразилось выбранное значение.
        =====================================================*/
        step1Page.enterSchoolDistrict();
        /*===================================================
        Шаг 37
        В поле "Район" выбрать из списка произвольное значение.
        ----------------------------------------------------
        Проверить:
        'В поле отобразилось выбранное значение.
        =====================================================*/
        step1Page.enterSchoolRayon();
        /*===================================================
        Шаг 38
        'В поле "Тип образовательной организации" включить чекбокс "Детский сад".
        ----------------------------------------------------
        Проверить:
        'Чекбокс включен
        =====================================================*/
        step1Page.clickCheckboxKinderGarden();
        /*===================================================
        Шаг 39
        Нажать на кнопку "Найти".
        ----------------------------------------------------
        Проверить:
        Отобразился блок "Результаты поиска организаций" со списком найденных организаций.
        =====================================================*/
        step1Page.clickFindKinderGarden();
        /*===================================================
        Шаг 40
        'Для одной организации нажать на ссылку "показать на карте".
        ----------------------------------------------------
        Проверить:
        'Откралсь карта с флажком над выбранной организацией
        =====================================================*/
//Шаг пропущен

        /*===================================================
        Шаг 41
        Под картой нажать на ссылку "Скрыть карту".
        ----------------------------------------------------
        Проверить:
        Карта свернулась.
        =====================================================*/
  //      step1Page.clickHideMap();

        /*===================================================
        Шаг 42
        'Нажать на ссылку "показать карту".
        ----------------------------------------------------
        Проверить:
        'Отобразилась карта Москвы с отмеченными результатами поиска.
        =====================================================*/
//        step1Page.clickShowMap();

        /*===================================================
        Шаг 45
        В поле "Место нахождения" включить "метро"
        ----------------------------------------------------
        Проверить:
        Радиокнопка включена.
        Появилось поле "Метро"
        =====================================================*/
        step1Page.clickRadiobuttonSearchSchoolByMetro();

        /*===================================================
        Шаг 46
        'В поле "Метро" выбрать из списка необходимое метро.
        ----------------------------------------------------
        Проверить:
        'В поле отобразилось выбранное значение.
        =====================================================*/
        step1Page.selectSearchSchoolByMetro();

        /*===================================================
        Шаг 47
        Включить оба чекбокса "Школа с дошкольным отделением", "Детский сад" и нажать на кнопку "Найти".
        ----------------------------------------------------
        Проверить:
        Отобразился блок "Результаты поиска организаций" со списком найденных организаций.
        =====================================================*/
        step1Page.searchSchoolByMetro();
        /*===================================================
        Шаг 48
        Для первых трех найденных организаций нажать на кнопки "Приоритетная", "Дополнительная 1" и "Дополнительная 2" соответственно". Убедиться, что кнопки находятся в нажатом положении.
        ----------------------------------------------------
        Проверить:
        'В нижней части страницы заполнился блок "Выбранные образовательные организации".Кнопки находятся в нажатом положении, цвет надписи на кнопке изменился.
        =====================================================*/
        step1Page.pressButtonsForFoundSchools();
        /*===================================================
        Шаг 50
        'Нажать на кнопку "Продолжить"
        ----------------------------------------------------
        Проверить:
        'Отобразился Шаг 2 "Сведения о ребенке".
        =====================================================*/
        step1Page.pressContinue();

        /*===================================================
        Шаг 51
        В блоке "Сведения о ребенке" заполнить следующие поля:
            - Фамилия (100 символов)
            - Имя (100 символов)
            - Отчество (100 символов)
        ----------------------------------------------------
        Проверить:
        Поля "Фамилия", "Имя", "Отчество" заполнены.
        =====================================================*/
        KindergartenServiceStep2Page step2Page = new KindergartenServiceStep2Page(driver);
        step2Page.fillChildData();
        /*===================================================
        Шаг 52
        'Отметить чек-бокс "Нет отчества".
        ----------------------------------------------------
        Проверить:
        'Поле "Отчество" стало неактивным для заполнения
        =====================================================*/
        step2Page.clickNotHaveMiddleName();
        /*===================================================
        Шаг 53
        В поле "Пол" активировать необходимую радиокнопку.
        ----------------------------------------------------
        Проверить:
        Выбранная радиокнопка активна.
        =====================================================*/
        step2Page.clickChildGender();
        /*===================================================
        Шаг 55
        Заполнить следующие поля:
            - Серия (латинские и русские буквы и знак «-», до 10-ти символов)
            - Номер (50 символов)
            - Когда выдан (не ранее даты, указанной в поле "Дата рождения")
            - Кем выдан (100 символов)
        ----------------------------------------------------
        Проверить:
        Поля "Серия", "Номер", "Когда выдан", "Кем выдан" заполнены.
        =====================================================*/
        step2Page.fillChildBirthDateStep2();
        step2Page.fillBirthCertificateData();
        /*===================================================
        Шаг 56
        В поле "Место выдачи свидетельства о рождении" выбрать "Москва" или "Российская федерация"
        =====================================================*/
        step2Page.selectPlaceOfDocCreated();
        /*===================================================
        Шаг 58
        Нажать на кнопку "Продолжить".
        =====================================================*/
        step2Page.clickNext();
        /*===================================================
        Шаг 59
        В поле "Выберите льготу" выбрать любой вариант, кроме "Нет льготы".
        =====================================================*/
        KindergartenServiceStep3Page step3Page = new KindergartenServiceStep3Page(driver);
        step3Page.selectExemption(); //для демо только 1 вариант "Дети-сироты"
        /*===================================================
        Шаг 60
        В поле "Является льготником" выбрать "Родитель".
        =====================================================*/
        step3Page.selectExemptionSubject();
        /*===================================================
        Шаг 61
        Включить чекбокс "Заполнить из личного кабинета".
        =====================================================*/
        step3Page.fillFromPersonalPage();
        /*===================================================
        Шаг 62
        Выключить чекбокс "Заполнить из личного кабинета".
        =====================================================*/
        step3Page.disableFillFromPersonalPage();
        /*===================================================
        Шаг 63
        Заполнить следующие поля:
        - Фамилия (100 символов)
        - Имя (100 символов)
        - Отчество (100 символов)
        - Дата рождения (10 цифр, возраст родителя выше возраста ребенка)
        - Номер СНИЛС
        =====================================================*/
        step3Page.fillParentInfo();
        /*===================================================
        Шаг 63
        Включить чекбокс "Нет отчества".
        =====================================================*/
        step3Page.nonMiddleNameCheckBoxSelect();
        /*===================================================
        Шаг 67
        В поле "Тип документа" выбрать "Паспорт гражданина РФ".
        =====================================================*/
        step3Page.selectPasportAsParentDoc();
        /*===================================================
        Шаг 68
        Заполнить поля
        - Серия документа (4 цифры)
        - Номер документа (6 цифр)
        =====================================================*/
        step3Page.fillParentDocumber();
        /*===================================================
        Шаг 69
        Нажать на кнопку "Продолжить".
        =====================================================*/
        step3Page.clickNext();
        /*===================================================
        Шаг 70
        В поле "Дата рождения" ввести корректные данные (10 цифр, возраст родителя выше возраста ребенка)
        =====================================================*/
        KindergartenServiceStep4Page step4Page = new KindergartenServiceStep4Page(driver);
        step4Page.fillParentBirthdate();
        /*===================================================
        Шаг 71
        В поле "Контактный телефон" ввести корректные данные (10 цифр по маске (XXX ) XXX-XX-XX, где «Х» - цифра)
        =====================================================*/
        step4Page.fillParentPhone();
        /*===================================================
        Шаг 72
        Из списка "Вид представительства" выбрть необходимый вариант.
        =====================================================*/
        step4Page.fillParentType();
        /*===================================================
        Шаг 73
        Включить чекбокс "Уведомление по электронной почте".
        =====================================================*/
        step4Page.checkBoxByEmail();
        /*===================================================
        Шаг 74
        В поле "Электронная почта" ввести корректные данные (По маске xxxxx@xxxx.xxx)
        =====================================================*/
        step4Page.fillEmailAddr();
        /*===================================================
        Шаг 75
        Включить чекбокс "Уведомление по SMS".
        =====================================================*/
        step4Page.checkBoxSMS();
        /*===================================================
        Шаг 76
        В поле "Контактный телефон" ввести корректные данные (10 цифр по маске (XXX ) XXX-XX-XX, где «Х» - цифра)
        =====================================================*/
        step4Page.fillSMSNumber();
        /*===================================================
        Шаг 77
        Нажать на кнопку "Отправить"
        =====================================================*/
        step4Page.clickSendButton();

        sleep(5000);
       //
       //выход
        mpguMainPage.openPage();
        loginPage.pressLogout();

    }


    public void closeCurrentTab(){
        driver.close();
    }
    public void switchMainTab(){
        ArrayList<String> newTab = new ArrayList<String>(driver.getWindowHandles());
        driver.switchTo().window(newTab.get(1));
    }

}
